
Функция CheckBarcode(Barcode, Status, Comment)
	Запрос = Новый Запрос("ВЫБРАТЬ
	         |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	         |ИЗ
	         |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	         |ГДЕ
	         |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод");
	Запрос.УстановитьПараметр("Штрихкод", Barcode);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда	
		Status = "OK";
		Comment = Строка(Результат.Номенклатура); 
	Иначе
		Status = "ER";
		Comment = "Штрихкод не найден"; 	
	КонецЕсли;
	Настройки = Справочники.isc_Настройки.НайтиПоКоду("000000001");
	Если Настройки.Логирование Тогда
		ЗаписатьЛог(Barcode,,,,, "Проверка штрихкода. " +  Status + "." + Comment);
	КонецЕсли;	
	Возврат "";

КонецФункции

Функция SaveParametrs(Barcode, Status, Comment, Length, Height, Width, Weight, ItemType)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                     |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	                     |	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
	                     |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	                     |ИЗ
	                     |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                     |ГДЕ
	                     |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод");
	Запрос.УстановитьПараметр("Штрихкод", Barcode);
	Результат = Запрос.Выполнить().Выбрать();
	Настройки = Справочники.isc_Настройки.НайтиПоКоду("000000001");	
	сткВходныеПараметры = Новый Структура("Length, Height, Width, Weight",Length, Height, Width, Weight);
	//сткВходныеПараметрыРУсские = Новый Структура("Length, Height, Width, Weight", "Ширина", "Высота", "Глубина", "Вес");
	Если Результат.Следующий() Тогда 
		//Каждое измерение может храниться в различных реквизитах
		Для Каждого стзМетодыХранения Из Настройки.МетодыХранения Цикл
			Если стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыУпаковки Тогда
				
				Упаковка = ПолучитьУпаковкуИзСоответствияУпаковкам(Результат.Номенклатура, Настройки.СоответствиеУпаковок.Найти(Число(ItemType),"ИдУпаковки"));
				Попытка
					Если ЗначениеЗАполнено(ItemType) И ЗначениеЗаполнено(Упаковка) Тогда 
						ОбъектХранения = Упаковка.ПолучитьОбъект();
					Иначе 
						ОбъектХранения = Результат.Упаковка.ПолучитьОбъект();	
					КонецЕсли;
					ОбъектХранения[стзМетодыХранения.Свойство_ИмяРеквизита] = сткВходныеПараметры[стзМетодыХранения.ИмяСвойства];
					ОбъектХранения.Записать();
				Исключение
					ЗаписатьЛог(Barcode, Length , Height , Width , Weight , "Запись ВГХ. Ошибка получения упаковки." );
				КонецПопытки;
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыНоменклатуры Тогда
				ОбъектХранения = Результат.Номенклатура.ПолучитьОбъект(); 
				ОбъектХранения[стзМетодыХранения.Свойство_ИмяРеквизита] = сткВходныеПараметры[стзМетодыХранения.ИмяСвойства];
				ОбъектХранения.Записать();
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопРеквизитыНоменклатуры Тогда
				ОбъектХранения = Результат.Номенклатура.ПолучитьОбъект();
			ЗаписатьДопРевизит(ОбъектХранения, стзМетодыХранения.Свойство_ИмяРеквизита, сткВходныеПараметры[стзМетодыХранения.ИмяСвойства]);			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопРеквизитыХарактеристики Тогда
				ОбъектХранения.Записать();
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопРеквизитыХарактеристики Тогда
				Если ЗначениеЗаполнено(Результат.Характеристика) Тогда
					ОбъектХранения = Результат.Характеристика.ПолучитьОбъект(); 
				Иначе 
					ОбъектХранения = Результат.Номенклатура.ПолучитьОбъект();
				КонецЕсли;
				ЗаписатьДопРевизит(ОбъектХранения, стзМетодыХранения.Свойство_ИмяРеквизита, сткВходныеПараметры[стзМетодыХранения.ИмяСвойства]);
				ОбъектХранения.Записать();
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопСведенияНоменклатуры Тогда
				РС = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				РС.Объект = Результат.Номенклатура; 
				РС.Свойство = стзМетодыХранения.Свойство_ИмяРеквизита;
				РС.Значение = сткВходныеПараметры[стзМетодыХранения.ИмяСвойства];
				РС.Записать();	
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопСведенияХарактеристики Тогда
				РС = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				Если ЗначениеЗаполнено(Результат.Характеристика) Тогда
					РС.Объект = Результат.Характеристика; 
				Иначе 
					РС.Объект = Результат.Номенклатура;
				КонецЕсли;
				
				РС.Свойство = стзМетодыХранения.Свойство_ИмяРеквизита;
				РС.Значение = сткВходныеПараметры[стзМетодыХранения.ИмяСвойства];	
				РС.Записать();	
			КонецЕсли;
				
				
		КонецЦикла;
		Status = "OK";
		Comment = Строка(Результат.Номенклатура); 
	Иначе
		Status = "ER";
		Comment = "Штрихкод не найден"; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройки) И Настройки.Логирование Тогда
		ЗаписатьЛог(Barcode, Length , Height , Width , Weight , "Запись ВГХ. " +  Status + ". -" + Comment);
	КонецЕсли;
	Возврат "";
КонецФункции  

Процедура ЗаписатьДопРевизит(ОбъектЗаписи, ДопРеквизит, Значение)
		   СтрДопРек = ОбъектЗаписи.ДополнительныеРеквизиты.Найти(ДопРеквизит,"Свойство");
		   Если ЗначениеЗаполнено(СтрДопРек)Тогда
			   СтрДопРек.Значение = Значение; 
		   Иначе
			   СтрДопРек = ОбъектЗаписи.ДополнительныеРеквизиты.Добавить();
			   СтрДопРек.Свойство = ДопРеквизит;
			   СтрДопРек.Значение = Значение;
		   КонецЕсли;
		   ОбъектЗаписи.Записать();
КонецПроцедуры

Функция ПолучитьУпаковкуИзСоответствияУпаковкам(Номенклатура, стрНастроек)
	Если Не ЗначениеЗаполнено(стрНастроек) Тогда
		Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|ГДЕ
	|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдИзм И 
	|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", Номенклатура); 
	Запрос.УстановитьПараметр("ЕдИзм", стрНастроек.ЕдиницаИзмерения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка(); 
	КонецЕсли;  
КонецФункции
	
Процедура ЗаписатьЛог(Barcode, Length = 0, Height = 0, Width = 0, Weight = 0, Событие)
	РС = РегистрыСведений.isc_ЛогСобытий.СоздатьМенеджерЗаписи();
	РС.Дата 		= ТекущаяДата();
	РС.Событие 		= Событие;
	РС.Штрихкод 	= Barcode;
	РС.Длина 		= Length;
	РС.Ширина 		= Width;
	РС.Высота 		= Height;
	РС.Масса 		= Weight;
	РС.Записать();
КонецПроцедуры	
