
Функция CheckBarcode(Barcode, Status, Comment)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод"
	);
	Запрос.УстановитьПараметр("Штрихкод", Barcode);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда	
		Status = "OK";
		Comment = Строка(Результат.Номенклатура); 
	Иначе
		Status = "ER";
		Comment = "Штрихкод не найден"; 	
	КонецЕсли;
	Настройки = Справочники.isc_Настройки.ПолучитьНастройкиУстройстваПоУмолчанию();
	Если Настройки.Логирование Тогда
		РегистрыСведений.isc_ЛогСобытий.ЗаписатьЛог(Barcode,,,,, "Проверка штрихкода. " +  Status + "." + Comment);
	КонецЕсли;	
	Возврат "";

КонецФункции

Функция SaveParametrs(Barcode, Status, Comment, Length, Height, Width, Weight, Volume, ItemType) 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод"
	);
	Запрос.УстановитьПараметр("Штрихкод", Barcode);
	Результат = Запрос.Выполнить().Выбрать();
	Настройки = Справочники.isc_Настройки.ПолучитьНастройкиУстройстваПоУмолчанию();	
	сткВГХ = Новый Структура("Barcode,Length,Height,Width,Weight,Volume,ItemType", Barcode, Length, Height, Width, Weight, Volume, ItemType);
	Если Результат.Следующий() Тогда
		
		// Каждое измерение может храниться в различных реквизитах
		isc_ОбщийМодуль.СохранитьВГХСогласноНастройкам(сткВГХ, Результат, Настройки);
		
		Status = "OK";
		Comment = Строка(Результат.Номенклатура); 
	Иначе
		Status = "ER";
		Comment = "Штрихкод не найден"; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройки) И Настройки.Логирование Тогда
		РегистрыСведений.isc_ЛогСобытий.ЗаписатьЛог(Barcode, Length , Height , Width , Weight , "Запись ВГХ. " +  Status + ". -" + Comment);
	КонецЕсли;
	Возврат "";  
	
КонецФункции  

		
