Функция УстановитьСоединенияНаСервере(ТестСоединения = Истина, ЧитатьИсторию = Ложь, ЭтаФорма = Неопределено) Экспорт
	Если Не ЭтаФорма = Неопределено И ЭтаФорма.ДанныеНаФормеИзменены Тогда
		СткНастройки = Новый Структура("АдресУстройства,Логин,Пароль,Порт,ЗащищенноеСоединение,EndPoint,Логирование");
		СткНастройки.АдресУстройства 			= Этаформа.АдресУстройства;
		СткНастройки.Логин 			 			= ЭтаФорма.Логин;
		СткНастройки.Пароль 		 			= Этаформа.Пароль;
		СткНастройки.Порт 			 			= ЭтаФорма.Порт;
		СткНастройки.ЗащищенноеСоединение 		= ЭтаФорма.ЗащищенноеСоединение;
		СткНастройки.EndPoint 			 		= ЭтаФорма.EndPoint;
		СткНастройки.Логирование 	 			= Ложь;
	Иначе
		СткНастройки = Справочники.isc_Настройки.ПолучитьНастройкиУстройства();
	КонецЕсли;
	Если ЧитатьИсторию Тогда
		СтраницаСервера	  = СтрЗаменить(сткНастройки.EndPoint,"data", "history");
	Иначе
		СтраницаСервера	  = сткНастройки.EndPoint;
	КонецЕсли;
	Если СткНастройки.ЗащищенноеСоединение Тогда
		
		Соединение = Новый HTTPСоединение(
		СткНастройки.АдресУстройства, //"89.175.58.20", // сервер (хост)
		СткНастройки.Порт, //60080, // порт, по умолчанию для http используется 80, для https 443
		СткНастройки.Логин,  //"user", // пользователь для доступа к серверу (если он есть)
		СткНастройки.Пароль, //"user", // пароль для доступа к серверу (если он есть)
		, // здесь указывается прокси, если он есть
		, // таймаут в секундах, 0 или пусто - не устанавливать
		Новый  ЗащищенноеСоединениеOpenSSL()// защищенное соединение, если используется https
		);
	Иначе
		Соединение = Новый HTTPСоединение(
		СткНастройки.АдресУстройства, //"89.175.58.20", // сервер (хост)
		СткНастройки.Порт, //60080, // порт, по умолчанию для http используется 80, для https 443
		СткНастройки.Логин,  //"user", // пользователь для доступа к серверу (если он есть)
		СткНастройки.Пароль, //"user", // пароль для доступа к серверу (если он есть)
		, // здесь указывается прокси, если он есть
		, // таймаут в секундах, 0 или пусто - не устанавливать
		);	
	КонецЕсли;
	Запрос = Новый HTTPЗапрос(СтраницаСервера);//"/data");
	Попытка
		Результат = Соединение.Получить(Запрос);
	Исключение
		Возврат Ложь;	
	КонецПопытки;	
	Возврат ?(ТестСоединения, Результат.КодСостояния = 200 ,Результат.ПолучитьТелоКакПоток());	
КонецФункции
