 #Область ОбработчикиСобытийФормы
 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	СткНастройки = Справочники.isc_Настройки.ПолучитьНастройкиУстройстваПоУмолчанию();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СткНастройки, ,"МетодыХранения");
	ЭтаФорма.МетодыХранения.Загрузить(СткНастройки.МетодыХранения);
	
	НастройкиУстройства = Справочники.isc_Настройки.Выбрать(,,,"Код Возр");
	Пока НастройкиУстройства.Следующий() Цикл  
		ДобавитьУстройствоНаСервере(НастройкиУстройства);  
	КонецЦикла;
	
	Элементы.УдалитьУстройство.Доступность = Ложь;
	
	ЭтаФорма.FinishSend3Д90 = Обработки.isc_РаботаСУстройством.ПолучитьМакет("FinishSend3Д90").ПолучитьТекст();
	
	ЭтаФорма.FinishSendКамера = Обработки.isc_РаботаСУстройством.ПолучитьМакет("FinishSendКамера").ПолучитьТекст();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередУдалением(РезультатВопроса, ПараметрыЗаписи) Экспорт	 
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда	
		ИмяНастройки = СтрЗаменить(Элементы.СтраницыУстройства.ТекущаяСтраница.Имя, "Стр", "");
		УдалитьУстройствоНаСервере(ИмяНастройки);
		ПоказатьОповещениеПользователя("Успешно!", ,"Устройство удалено.", БиблиотекаКартинок.ПиктограммаПоказателяЦельДостигнута);	
		СтраницыУстройстваПриСменеСтраницы(Неопределено, Неопределено);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
 
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройки(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтрНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимJSON(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтрРежимJSON;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимSOAP(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтрРежимSOAP;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьНастройкиНаСервере();
	//ЭтаФорма.ДанныеНаФормеИзменены = Ложь; 

КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьУстройство(Команда)
	
	ДобавитьУстройствоНаСервере();
	СтраницыУстройстваПриСменеСтраницы(Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛогСобытий(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтрЛогСобытий;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСоединения(Команда)
	
	Если Элементы.СтраницыУстройства.ПодчиненныеЭлементы.Количество() = 1 Тогда
		ИмяНастройки = "000000001";	
	Иначе	
		ИмяНастройки = СтрЗаменить(Элементы.СтраницыУстройства.ТекущаяСтраница.Имя, "Стр", "");
	КонецЕсли;
	КодОтвета = УстановитьСоединениеНаСервере(ИмяНастройки);
	Если КодОтвета = 200 Тогда
		ПоказатьОповещениеПользователя("Успешно!",,"Успешно подключение к устройству.", БиблиотекаКартинок.ПиктограммаПоказателяЦельДостигнута);	
	ИначеЕсли КодОтвета = 502 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка в настройках оборудования: Не удалось установить подключение к оборудованию. Проверьте шаблоны на устройстве.");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка подключения: Не удалось установить подключение к оборудованию. Проверьте настройки.");
	КонецЕсли;  

КонецПроцедуры

&НаКлиенте
Процедура УдалитьУстройство(Команда)
	
	  ПоказатьВопрос(Новый ОписаниеОповещения("ВопросПередУдалением", ЭтотОбъект), "Настройки устройства будут удалены безвозвратно. Продолжить?", РежимДиалогаВопрос.ДаНет,,, "Предупреждение");	

 КонецПроцедуры
  
  &НаКлиенте
Процедура СохранитьУстройство(Команда)
	
	ИмяНастройки = СтрЗаменить(Элементы.СтраницыУстройства.ТекущаяСтраница.Имя, "Стр", "");
	СохранитьУстройствоНаСервере(ИмяНастройки); 
	ПоказатьОповещениеПользователя("Успешно!", ,"Устройство сохранено.", БиблиотекаКартинок.ПиктограммаПоказателяЦельДостигнута);
	
КонецПроцедуры

&НаКлиенте
Процедура Описание(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.стрОписание;
	
КонецПроцедуры

&НаКлиенте
Процедура StartSession(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Устройство) Тогда
		ПоказатьОповещениеПользователя("Не указаны настройки", ,"Выберите оборудование.", БиблиотекаКартинок.НовостиВажные); 
		Возврат;
	КонецЕсли;	
	Если УстановитьСоединениеНаСервере(ЭтаФорма.Устройство, Истина, Ложь) = Ложь Тогда
		ПоказатьОповещениеПользователя("Ошибка подключения", ,"Не удалось установить подключение к оборудованию. Проверьте настройки.", БиблиотекаКартинок.НовостиВажные);
		Возврат;
	КонецЕсли;	
	ПодключитьОбработчикОжидания("StartSessionНаКл", 5, Ложь);
	Элементы.StartSession.Отображение = ОтображениеКнопки.Картинка;
	ПоказатьОповещениеПользователя("Внимание.",,"Начат опрос устройства. Начинайте сканировать товар.", БиблиотекаКартинок.Новости);

КонецПроцедуры

&НаКлиенте
Процедура StopSession(Команда)
	
	ОтключитьОбработчикОжидания("StartSessionНаКл");
	Элементы.StartSession.Отображение = ОтображениеКнопки.Текст;
	ПоказатьОповещениеПользователя("Внимание.",,"Устройство не опрашивается."); 

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВБазу1(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьВБазу", ЭтотОбъект), "Данные будут записаны согласно настройкам. Данные в реквизитах будут перезаписаны. Продолжить?", РежимДиалогаВопрос.ДаНет,,, "Предупреждение");

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьИсториюИзмерений(Команда)
	
	ЗаполнитьТчНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВCSV(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);  // выбор каталога
	ДиалогВыбораФайла.Заголовок = "Укажите имя файла выгрузки!";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Путь = ДиалогВыбораФайла.ПолноеИмяФайла + ".csv";    // присваиваем переменной путь выбранного каталога + имя будущего файла    
		т = Новый ТекстовыйДокумент;
		т.УстановитьТекст(СформироватьИВернутьCSV());
		Попытка
			т.Записать(Путь);
			ПоказатьОповещениеПользователя("Успешно!",,"Файл сохранен.");
		Исключение
			
		КонецПопытки;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТЧ(Команда)
	
	Объект.HistoryOfScaning.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестSOAP(Команда)
	ТестSOAPНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура МетодыХраненияСвойство_ИмяРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Примечание = "";
	Если Элементы.МетодыХранения.ТекущиеДанные.МетодХраненияВГХ = ПредопределенноеЗначение("Перечисление.isc_МетодХраненияВГХ.РеквизитыУпаковки")  ИЛИ Элементы.МетодыХранения.ТекущиеДанные.МетодХраненияВГХ = ПредопределенноеЗначение("Перечисление.isc_МетодХраненияВГХ.РеквизитыНоменклатуры") Тогда	
		сзРеквизитов = Новый СписокЗначений;
		сзРеквизитов = ПолучитьсзРеквизитов(Элементы.МетодыХранения.ТекущиеДанные.МетодХраненияВГХ);
		ВыбЭлемент = сзРеквизитов.ВыбратьЭлемент("Укажите реквизит в котором хранится измерение."); 
		Элементы.МетодыХранения.ТекущиеДанные.Примечание = "Измерение будет записано в указанный реквизит";
		Если НЕ ВыбЭлемент = Неопределено Тогда
			Элементы.МетодыХранения.ТекущиеДанные.Свойство_ИмяРеквизита = ВыбЭлемент.Значение;
		КонецЕсли;
	Иначе
		Свойство = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка");
		ВвестиЗначение(Свойство);
		Элементы.МетодыХранения.ТекущиеДанные.Свойство_ИмяРеквизита = Свойство;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыУстройстваПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.СтраницыУстройства.ТекущаяСтраница = Элементы.СтраницыУстройства.ПодчиненныеЭлементы.Получить(0) Тогда
		Элементы.УдалитьУстройство.Доступность = Ложь;
	Иначе	
		Элементы.УдалитьУстройство.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

 #Область СлужебныеПроцедурыИФункции
 
&НаСервере
Процедура ДобавитьУстройствоНаСервере(Знач НастройкиУстройства = Неопределено)

	Если НастройкиУстройства = Неопределено Тогда
		НастройкиУстройства = Справочники.isc_Настройки.СоздатьЭлемент(); 
		НастройкиУстройства.УстановитьНовыйКод();
	КонецЕсли;	
	
	//Определяем массив добавляемых реквизитов

	ДобавляемыеРеквизиты = Новый Массив; 
	НовыйРеквизит = Новый РеквизитФормы("IP" + НастройкиУстройства.Код,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(500)),,"Адрес устройства"); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
	НовыйРеквизит = Новый РеквизитФормы("EndPoint" + НастройкиУстройства.Код,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(500)),,"EndPoint"); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("Port" + НастройкиУстройства.Код,Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0)),,"Порт"); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
	НовыйРеквизит = Новый РеквизитФормы("SSL" + НастройкиУстройства.Код,Новый ОписаниеТипов("Булево"),,"Защищенное соединение(https)"); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("Login" + НастройкиУстройства.Код,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150)),,"Логин"); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("Pass" + НастройкиУстройства.Код,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150)),,"Пароль"); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	НовыйРеквизит = Новый РеквизитФормы("Код" + НастройкиУстройства.Код,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(500)),,"Код устройства"); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
	НовыйРеквизит = Новый РеквизитФормы("Наименование" + НастройкиУстройства.Код,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(500)),,"Наименование"); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 

	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
	ЭтаФорма["Код" + НастройкиУстройства.Код] 			= НастройкиУстройства.Код; 
	ЭтаФорма["Наименование" + НастройкиУстройства.Код] 	= НастройкиУстройства.Наименование; 
	ЭтаФорма["IP" + НастройкиУстройства.Код] 			= НастройкиУстройства.АдресУстройства;
    ЭтаФорма["EndPoint" + НастройкиУстройства.Код] 		= НастройкиУстройства.EndPoint;
    ЭтаФорма["Port" + НастройкиУстройства.Код] 			= НастройкиУстройства.Порт;
    ЭтаФорма["SSL" + НастройкиУстройства.Код] 			= НастройкиУстройства.ЗащищенноеСоединение;
    ЭтаФорма["Login" + НастройкиУстройства.Код] 		= НастройкиУстройства.Логин;
    ЭтаФорма["Pass" + НастройкиУстройства.Код] 			= НастройкиУстройства.Пароль;
	
	СтраницаУстройства = Элементы.Добавить("Стр" + НастройкиУстройства.Код, Тип("ГруппаФормы"), Элементы.СтраницыУстройства);
	СтраницаУстройства.Вид = ВидГруппыФормы.Страница;
	СтраницаУстройства.Заголовок = НастройкиУстройства.Наименование; 
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Наименование" + НастройкиУстройства.Код, Тип("ПолеФормы"), СтраницаУстройства);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Наименование" + НастройкиУстройства.Код; 
    Если НастройкиУстройства.Код = "000000001" Тогда
		НовыйЭлемент.ТолькоПросмотр = Истина;	
	КонецЕсли;	
	ГруппаАдресУстройства = Элементы.Добавить("ГруппаАдресУстройства" + НастройкиУстройства.Код,  Тип("ГруппаФормы"), СтраницаУстройства); 
	ГруппаАдресУстройства.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАдресУстройства.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаАдресУстройства.Отображение = ОтображениеОбычнойГруппы.Нет;       
	ГруппаАдресУстройства.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("IP" + НастройкиУстройства.Код, Тип("ПолеФормы"), ГруппаАдресУстройства);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "IP" + НастройкиУстройства.Код;  
	НовыйЭлемент.ПодсказкаВвода = "192.168.1.100";
	НовыйЭлемент.Ширина = 11;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("EndPoint" + НастройкиУстройства.Код, Тип("ПолеФормы"), ГруппаАдресУстройства);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "EndPoint" + НастройкиУстройства.Код; 
	НовыйЭлемент.ПодсказкаВвода = "/api/data";

		
	ГруппаПорт = Элементы.Добавить("ГруппаПорт" + НастройкиУстройства.Код,  Тип("ГруппаФормы"), СтраницаУстройства); 
	ГруппаПорт.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПорт.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПорт.Отображение = ОтображениеОбычнойГруппы.Нет;  
	ГруппаПорт.ОтображатьЗаголовок = Ложь;

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Port" + НастройкиУстройства.Код, Тип("ПолеФормы"), ГруппаПорт);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Port" + НастройкиУстройства.Код;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("SSL" + НастройкиУстройства.Код, Тип("ПолеФормы"), ГруппаПорт);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "SSL" + НастройкиУстройства.Код;
    НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;

    НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Login" + НастройкиУстройства.Код, Тип("ПолеФормы"), СтраницаУстройства);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Login" + НастройкиУстройства.Код;
	НовыйЭлемент.Подсказка = "user";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Pass" + НастройкиУстройства.Код, Тип("ПолеФормы"), СтраницаУстройства);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Pass" + НастройкиУстройства.Код;
	НовыйЭлемент.Подсказка = "user";
	
	
	ГруппаКнопки = Элементы.Добавить("ГруппаКнопки" + НастройкиУстройства.Код,  Тип("ГруппаФормы"), СтраницаУстройства); 
	ГруппаКнопки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКнопки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаКнопки.Отображение = ОтображениеОбычнойГруппы.Нет;       
	ГруппаКнопки.ОтображатьЗаголовок = Ложь;
	 
	Элементы.СтраницыУстройства.ТекущаяСтраница = СтраницаУстройства;
	НастройкиУстройства = Неопределено;
		
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере() 

	СткНастройки = Новый Структура("Логирование,МетодыХранения");
	ЗаполнитьЗначенияСвойств(СткНастройки, ЭтаФорма);
	Настройки = Справочники.isc_Настройки.НайтиПоКоду("000000001");
	Если Не ЗначениеЗаполнено(Настройки) Тогда
		Настройки = Справочники.isc_Настройки.СоздатьЭлемент();
		Настройки.Код = "000000001";
	Иначе
		Настройки = Настройки.ПолучитьОбъект();
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(Настройки, СткНастройки);
	Настройки.МетодыХранения.Загрузить(ЭтаФорма.МетодыХранения.Выгрузить());
	
	Настройки.Записать();
	ОбщегоНазначения.СообщитьПользователю("Настройки сохранены!");  
	
КонецПроцедуры

&НаСервере
Функция ПолучитьсзРеквизитов(МетодХраненияВГХ) 
	
	сзРеквизиты = НОвый СписокЗначений; 
	Если МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыУпаковки Тогда
		ТипРеквизита = Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения");                                                               
	Иначе
		ТипРеквизита = Тип("СправочникСсылка.Номенклатура");
	КонецЕсли;
	Для Каждого элем Из Метаданные.НайтиПоТипу(ТипРеквизита).Реквизиты Цикл
		сзРеквизиты.Добавить(элем.Имя, Элем.Синоним);
	КонецЦикла;
	сзРеквизиты.СортироватьПоПредставлению();
	
	Возврат сзРеквизиты; 
	
КонецФункции	

&НаСервере
Функция УстановитьСоединениеНаСервере(ИмяНастройки, ТестСоединения = Истина, ЧитатьИсторию  = Ложь)
	
	Если ТипЗнч(ИмяНастройки) = Тип("Строка") Тогда
	  	СткНастройки = Новый Структура("АдресУстройства,Логин,Пароль,Порт,ЗащищенноеСоединение,EndPoint,Логирование");
		СткНастройки.АдресУстройства 			= ЭтаФорма["IP" + ИмяНастройки];
		СткНастройки.Логин 			 			= ЭтаФорма["Login" + ИмяНастройки];
		СткНастройки.Пароль 		 			= ЭтаФорма["Pass" + ИмяНастройки];
		СткНастройки.Порт 			 			= ЭтаФорма["Port" + ИмяНастройки];
		СткНастройки.ЗащищенноеСоединение 		= ЭтаФорма["SSL" + ИмяНастройки];
		СткНастройки.EndPoint 			 		= ЭтаФорма["EndPoint" + ИмяНастройки];
		СткНастройки.Логирование 	 			= ЭтаФорма.Логирование;
	  
	  Возврат Обработки.isc_РаботаСУстройством.УстановитьСоединенияНаСервере(ТестСоединения, ЧитатьИсторию, СткНастройки); 
	  
  Иначе
	  
	  Возврат Обработки.isc_РаботаСУстройством.УстановитьСоединенияНаСервере(ТестСоединения, ЧитатьИсторию, ЭтаФорма.Устройство); 

  КонецЕсли;
	  
 КонецФункции

 &НаСервере
Процедура УдалитьУстройствоНаСервере(ИмяНастройки)

	спр = Справочники.isc_Настройки.НайтиПоКоду(ИмяНастройки);
	Если ЗначениеЗаполнено(спр) Тогда
	     спр.ПолучитьОбъект().Удалить(); 
	КонецЕсли;
	Элементы.Удалить(Элементы["Стр" + ИмяНастройки]); 
    Элементы.СтраницыУстройства.ТекущаяСтраница = Элементы.СтраницыУстройства.ПодчиненныеЭлементы.Получить(0);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьУстройствоНаСервере(ИмяНастройки)

	устр = Справочники.isc_Настройки.НайтиПоКоду(ИмяНастройки);
	Если ЗначениеЗаполнено(устр) Тогда
	     устр = устр.ПолучитьОбъект();
	 Иначе
		 устр = Справочники.isc_Настройки.СоздатьЭлемент();
	 КонецЕсли;                                             
	 
	устр.Код 						= ЭтаФорма["Код" + ИмяНастройки];
	устр.Наименование 				= ЭтаФорма["Наименование" + ИмяНастройки]; 
	устр.АдресУстройства 			= ЭтаФорма["IP" + ИмяНастройки];
	устр.Логин 			 			= ЭтаФорма["Login" + ИмяНастройки];
	устр.Пароль 		 			= ЭтаФорма["Pass" + ИмяНастройки];
	устр.Порт 			 			= ЭтаФорма["Port" + ИмяНастройки];
	устр.ЗащищенноеСоединение 		= ЭтаФорма["SSL" + ИмяНастройки];
	устр.EndPoint 			 		= ЭтаФорма["EndPoint" + ИмяНастройки];
    устр.Записать();
	Элементы["Стр" + ИмяНастройки].Заголовок = устр.Наименование; 
	
КонецПроцедуры

 &НаКлиенте
Процедура StartSessionНаКл() 
	
	ЗаполнитьТчНаСервере();  
	
КонецПроцедуры

 &НаКлиенте
Процедура СохранитьВБазу(РезультатВопроса, ПараметрыЗаписи) Экспорт	 
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если Объект.HistoryOfScaning.НайтиСтроки(Новый Структура("Status",ПредопределенноеЗначение("Перечисление.isc_СтатусыРучнаяОбработка.ШКУстановленВручную"))).Количество() > 0 
			ИЛИ Объект.HistoryOfScaning.НайтиСтроки(Новый Структура("Status",ПредопределенноеЗначение("Перечисление.isc_СтатусыРучнаяОбработка.ДанныеПолучены"))).Количество() > 0 Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьВБазуНовыеШтрихкоды", ЭтотОбъект), "Обнаружены строки с ручной установкой штрихкода (несопоставленным штрихкодом). Создавать новые штрихкоды в базе?", РежимДиалогаВопрос.ДаНет,,, "Предупреждение");
		Иначе	
			ЗагрузитьВНоменклатуруНаСервере();
			ПоказатьОповещениеПользователя("Операция завершена.");
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВБазуНовыеШтрихкоды(РезультатВопроса, ПараметрыЗаписи) Экспорт	 
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда			
		ЗагрузитьВНоменклатуруНаСервере(Истина);
	Иначе	
		ЗагрузитьВНоменклатуруНаСервере();	
	КонецЕсли;	
	ПоказатьОповещениеПользователя("Операция завершена.");
	
КонецПроцедуры

 &НаСервере
Процедура ЗагрузитьВНоменклатуруНаСервере(СоздаватьНовыеШК = Ложь, стч = Неопределено)  
	
	Если стч = Неопределено Тогда
		Для Каждого строкатабчасти из Объект.HistoryOfScaning Цикл
			ЗаписьВНоменклатуру(СоздаватьНовыеШК, строкатабчасти);
		КонецЦикла;
	Иначе
		ЗаписьВНоменклатуру(СоздаватьНовыеШК, стч);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьВНоменклатуру(СоздаватьНовыеШК, Знач стч)
	
	Настройки = Справочники.isc_Настройки.ПолучитьНастройкиУстройстваПоУмолчанию();	
	сткВГХ = Новый Структура("Barcode,Length, Height, Width, Weight,Volume,ItemType", стч.Barcode, стч.Length, стч.Height,стч.Width, стч.Weight, стч.Volume, стч.Ratio );

	Попытка	
		
		// Каждое измерение может храниться в различных реквизитах
		isc_ОбщийМодуль.СохранитьВГХСогласноНастройкам(сткВГХ, стч, Настройки);
		
		Если СоздаватьНовыеШК И (стч.Status = Перечисления.isc_СтатусыРучнаяОбработка.ДанныеПолучены ИЛИ стч.Status = Перечисления.isc_СтатусыРучнаяОбработка.ШКУстановленВручную) Тогда 
			РСШК 				= РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
			РСШК.Штрихкод 		= стч.Barcode;
			РСШК.Номенклатура 	= стч.Номенклатура;
			РСШК.Характеристика = стч.Характеристика;
			РСШК.Упаковка 		= стч.Упаковка;
			РСШК.Записать(); 
			РегистрыСведений.isc_ЛогСобытий.ЗаписатьЛог(стч.Barcode, стч.Length , стч.Height , стч.Width ,стч. Weight , "Создан штрихкод для номенклатуры """ + стч.Номенклатура + """. Форма опроса устройства." );
		КонецЕсли;
		стч.Status = Перечисления.isc_СтатусыРучнаяОбработка.ДанныеЗаписаныВБД;
		РегистрыСведений.isc_ЛогСобытий.ЗаписатьЛог(стч.Barcode, стч.Length , стч.Height , стч.Width ,стч. Weight , "Записаны ВГХ. Форма опроса устройства." );
	Исключение
		стч.Status = Перечисления.isc_СтатусыРучнаяОбработка.ОшибкаСохраненияВБД;
		РегистрыСведений.isc_ЛогСобытий.ЗаписатьЛог(стч.Barcode, стч.Length , стч.Height , стч.Width ,стч. Weight , "Ошибка записи ВГХ. Форма опроса устройства." );
	КонецПопытки; 
	
КонецПроцедуры

 &НаСервере
Процедура ЗаполнитьТчНаСервере(ЧитатьИсторию = Ложь)      
	
	соотДанныеСОборудования = ПрочитатьДанныеОборудования(ЧитатьИсторию);	
	Если соотДанныеСОборудования = Ложь Или Не ЗначениеЗаполнено(соотДанныеСОборудования["barcode"]) Тогда Возврат; КонецЕсли;
	
	мНайденныхСтрок =  Объект.HistoryOfScaning.НайтиСтроки(Новый Структура("Barcode", соотДанныеСОборудования["barcode"]));
	Если мНайденныхСтрок.Количество() > 0 Тогда 
		// Заменим данные в таблице полученными данными
		стч = мНайденныхСтрок[0];	
	Иначе
		стч = Объект.HistoryOfScaning.Добавить();
	КонецЕсли;	
	стч.Barcode = соотДанныеСОборудования["barcode"];
	стч.Length 	= соотДанныеСОборудования["length"];
	стч.Width 	= соотДанныеСОборудования["width"];
	стч.Height 	= соотДанныеСОборудования["height"];
	стч.Weight 	= соотДанныеСОборудования["weight"];
	стч.Volume 	= соотДанныеСОборудования["volume"];
	стч.Ratio 	= соотДанныеСОборудования["ratio"];
	стч.Status = Перечисления.isc_СтатусыРучнаяОбработка.ДанныеПолучены;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	Запрос.УстановитьПараметр("Штрихкод", соотДанныеСОборудования["barcode"]);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стч, Выборка);
		стч.Status = Перечисления.isc_СтатусыРучнаяОбработка.ШКСопоставлен;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьДанныеОборудования(ЧитатьИсторию) 
	
	соотДанныеСОборудования = Новый Соответствие;
	соотДанныеСОборудования.Вставить("barcode", "");
	соотДанныеСОборудования.Вставить("length", 0);
	соотДанныеСОборудования.Вставить("width", 0);
	соотДанныеСОборудования.Вставить("height", 0);
	соотДанныеСОборудования.Вставить("weight", 0);
	соотДанныеСОборудования.Вставить("volume", 0);
	соотДанныеСОборудования.Вставить("ratio", 1);
	ТелоОтвета =  УстановитьСоединениеНаСервере(ЭтаФорма.Устройство, Ложь, ЧитатьИсторию);
	
	Если ТелоОтвета = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;
	Чтение.ОткрытьПоток(ТелоОтвета);
	Попытка
		стк = ПрочитатьJSON(Чтение);
	Исключение
		Сообщить("Ошибка парсинга.Проверьте алгоритм FinishSend.");
		ИнфаОбОшибке = ИнформацияОбОшибке();
		Сообщить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфаОбОшибке));
		Возврат Ложь;
	КонецПопытки;	
	Если ЧитатьИсторию Тогда
		Если Не ЗначениеЗаполнено(стк) Тогда
			
			Сообщить("История измерений пуста.");
			
		Иначе
			
			Для Каждого элемМассива Из стк Цикл
				Для Каждого Параметр из элемМассива.data Цикл
					
					соотДанныеСОборудования.Вставить(Параметр.Ключ, Параметр.Значение);	
					
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Для Каждого Параметр из стк Цикл
			
			соотДанныеСОборудования.Вставить(Параметр.Ключ, Параметр.Значение);	
			
		КонецЦикла;
	КонецЕсли;
	
	Если соотДанныеСОборудования.Получить("ratio") = Неопределено Тогда
		соотДанныеСОборудования.Вставить("ratio", 1);
	КонецЕсли;
	Чтение.Закрыть();
	Возврат соотДанныеСОборудования;
	
КонецФункции

&НаКлиенте
Функция СформироватьИВернутьCSV()
	
	ТекстCSV = "Barcode;Length;Width;Height;Weight;Ratio;КодНоменклатуры;" + Символы.ПС;;
	Для Каждого стч Из Объект.HistoryOfScaning Цикл
		ТекстCSV = ТекстCSV + 
		стч.Barcode + ";" +
		стч.Length + ";" +
		стч.Width + ";" +
		стч.Height + ";" +
		стч.Weight + ";" +
		стч.Ratio + ";" +
		стч.Номенклатура + ";" +
		Символы.ПС;
	КонецЦикла;	
	Возврат ТекстCSV; 
	
КонецФункции

&НаСервере
Процедура ТестSOAPНаСервере()
	
	мСтрок = СтрРазделить(СтрЗаменить(ЭтаФорма.АдресПубликации, "?wsdl", ""), "/");
	Сервер = мСтрок[2];
	ЕндПойнт = "/" + мСтрок[3] + "/" + мСтрок[4] + "/" + мСтрок[5];
	Попытка
		Соединение = Новый HTTPСоединение(Сервер, 80, ЭтотОбъект.ТестЛогин, ЭтотОбъект.ТестПароль, , 30, );
	Исключение
		Сообщить("Не удалось подключиться к серверу: " + Сервер);
		Возврат;
	КонецПопытки;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Заголовки.Вставить("Accept",       "application/json");
	
	ТелоЗапроса = 
	"<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:tns=""iscan.com"">
	|  <soapenv:Header/>
	|  <soapenv:Body>
	|    <tns:SaveParametrs>
	|      <tns:Barcode>"
	 + ЭтотОбъект.ТестШтрихкод +
	"</tns:Barcode>
	|      <tns:Length>10.5</tns:Length>
	|      <tns:Height>5.0</tns:Height>
	|      <tns:Width>8.0</tns:Width>
	|      <tns:Weight>0.5</tns:Weight>
	|      <tns:Volume>0.5</tns:Volume>
	|      <tns:ItemType>1</tns:ItemType>
	|    </tns:SaveParametrs>
	|  </soapenv:Body>
	|</soapenv:Envelope>";
	
	Запрос = Новый HTTPЗапрос(ЕндПойнт, Заголовки);
	Запрос.УстановитьТелоИзСтроки(
    ТелоЗапроса,
    КодировкаТекста.UTF8,
    ИспользованиеByteOrderMark.НеИспользовать);

	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	ЭтаФорма.ОтветСервера = Ответ.ПолучитьТелоКакСтроку();
	
КонецПроцедуры
  
#КонецОбласти



