Функция ПолучитьНастройкиУстройства() Экспорт
    СткНастройки = Новый Структура("АдресУстройства,Логин,Пароль,Порт,ЗащищенноеСоединение,EndPoint,Логирование");
	Настройки = Справочники.isc_Настройки.НайтиПоКоду("000000001");
	Если Не ЗначениеЗаполнено(Настройки) Тогда
		Настройки = Справочники.isc_Настройки.СоздатьЭлемент();
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Length";
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Height";
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Width";
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Weight";
		Настройки.Записать();
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(СткНастройки, Настройки);
	СткНастройки.Вставить("МетодыХранения",Настройки.МетодыХранения.Выгрузить());
	СткНастройки.Вставить("СоответствиеУпаковок",Настройки.СоответствиеУпаковок.Выгрузить());
	Возврат СткНастройки;
КонецФункции