Процедура ЗаписатьДопРевизит(ОбъектЗаписи, ДопРеквизит, Значение) Экспорт 
	
	СтрДопРек = ОбъектЗаписи.ДополнительныеРеквизиты.Найти(ДопРеквизит, "Свойство");
	Если ЗначениеЗаполнено(СтрДопРек)Тогда
		СтрДопРек.Значение = Значение; 
	Иначе
		СтрДопРек = ОбъектЗаписи.ДополнительныеРеквизиты.Добавить();
		СтрДопРек.Свойство = ДопРеквизит;
		СтрДопРек.Значение = Значение;
	КонецЕсли;
	ОбъектЗаписи.Записать();  
	
КонецПроцедуры

Функция ПолучитьУпаковкуИзСоответствияУпаковкам(Номенклатура, стрНастроек) Экспорт 
	
	Если Не ЗначениеЗаполнено(стрНастроек) Тогда
		Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|ГДЕ
	|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдИзм И 
	|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец"
	);
	Запрос.УстановитьПараметр("Владелец", Номенклатура); 
	Запрос.УстановитьПараметр("ЕдИзм", стрНастроек.ЕдиницаИзмерения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка(); 
	КонецЕсли;   
	
КонецФункции 

Процедура СохранитьВГХСогласноНастройкам(сткВГХ, ДанныеОбъектаСохранения, Настройки) Экспорт
	
		Для Каждого стзМетодыХранения Из Настройки.МетодыХранения Цикл
			Если стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыУпаковки Тогда
				
				Упаковка = isc_ОбщийМодуль.ПолучитьУпаковкуИзСоответствияУпаковкам(ДанныеОбъектаСохранения.Номенклатура, Настройки.СоответствиеУпаковок.Найти(Число(сткВГХ.ItemType),"ИдУпаковки"));
				Попытка
					Если ЗначениеЗаполнено(сткВГХ.ItemType) И ЗначениеЗаполнено(Упаковка) Тогда 
						ОбъектХранения = Упаковка.ПолучитьОбъект();
					Иначе 
						ОбъектХранения = ДанныеОбъектаСохранения.Упаковка.ПолучитьОбъект();	
					КонецЕсли;
					ОбъектХранения[стзМетодыХранения.Свойство_ИмяРеквизита] = сткВГХ[стзМетодыХранения.ИмяСвойства];
					ОбъектХранения.Записать();
				Исключение
					РегистрыСведений.isc_ЛогСобытий.ЗаписатьЛог(сткВГХ.Barcode, сткВГХ.Length , сткВГХ.Height , сткВГХ.Width , сткВГХ.Weight , "Запись ВГХ. Ошибка получения упаковки." );
				КонецПопытки;
				
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыНоменклатуры Тогда
				
				//Если стзМетодыХранения.ИмяСвойства = "Volume" Тогда Продолжить; КонецЕсли; // Объем в реквизитах номенклатуры, рассчитается на основании вгх типовым функционалом
				
				ОбъектХранения = ДанныеОбъектаСохранения.Номенклатура.ПолучитьОбъект(); 
				ОбъектХранения[стзМетодыХранения.Свойство_ИмяРеквизита] = сткВГХ[стзМетодыХранения.ИмяСвойства];
				ОбъектХранения.Записать(); 
				
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопРеквизитыНоменклатуры Тогда
				
				ОбъектХранения = ДанныеОбъектаСохранения.Номенклатура.ПолучитьОбъект();
				isc_ОбщийМодуль.ЗаписатьДопРевизит(ОбъектХранения, стзМетодыХранения.Свойство_ИмяРеквизита, сткВГХ[стзМетодыХранения.ИмяСвойства]);			
				ОбъектХранения.Записать(); 
				
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопРеквизитыХарактеристики Тогда
				
				Если ЗначениеЗаполнено(ДанныеОбъектаСохранения.Характеристика) Тогда
					ОбъектХранения = ДанныеОбъектаСохранения.Характеристика.ПолучитьОбъект(); 
				Иначе 
					ОбъектХранения = ДанныеОбъектаСохранения.Номенклатура.ПолучитьОбъект();
				КонецЕсли;
				isc_ОбщийМодуль.ЗаписатьДопРевизит(ОбъектХранения, стзМетодыХранения.Свойство_ИмяРеквизита, сткВГХ[стзМетодыХранения.ИмяСвойства]);
				ОбъектХранения.Записать(); 
				
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопСведенияНоменклатуры Тогда
				
				РС = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				РС.Объект = ДанныеОбъектаСохранения.Номенклатура; 
				РС.Свойство = стзМетодыХранения.Свойство_ИмяРеквизита;
				РС.Значение = сткВГХ[стзМетодыХранения.ИмяСвойства];
				РС.Записать();	    
				
			ИначеЕсли стзМетодыХранения.МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопСведенияХарактеристики Тогда
				
				РС = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				Если ЗначениеЗаполнено(ДанныеОбъектаСохранения.Характеристика) Тогда
					РС.Объект = ДанныеОбъектаСохранения.Характеристика; 
				Иначе 
					РС.Объект = ДанныеОбъектаСохранения.Номенклатура;
				КонецЕсли;
				
				РС.Свойство = стзМетодыХранения.Свойство_ИмяРеквизита;
				РС.Значение = сткВГХ[стзМетодыХранения.ИмяСвойства];	
				РС.Записать();	
				
			КонецЕсли;
								
		КонецЦикла;
	
КонецПроцедуры	
